Repository: KDE/kdenetwork-filesharing
Catalog: po/*/kfileshare.po
Languages: be

# @option:radio an entry denying permissions
source: Deny
be: Адхіліць

# @option:radio an entry allowing permissions
source: Allow
be: Дазволіць

# @option:radio an unknown permission entry type (doesn't really happen)
source: Unknown
be: Невядома

# @option:radio permission applicability type
source: This folder only
be: Толькі гэты каталог

# @option:radio permission applicability type
source: This folder, subfolders and files
be: Гэты каталог, укладзеныя каталогі і файлы

# @option:radio permission applicability type
source: This folder and subfolders
be: Гэты каталог і ўкладзеныя каталогі

# @option:radio permission applicability type
source: This folder and files
be: Гэты каталог і файлы

# @option:radio permission applicability type
source: Subfolders and files only
be: Толькі ўкладзеныя каталогі і файлы

# @option:radio permission applicability type
source: Subfolders only
be: Толькі ўкладзеныя каталогі

# @option:radio permission applicability type
source: Files only
be: Толькі файлы

# @option:radio permission applicability type (doesn't really happen)
source: Unknown
be: Невядома

# @title:tab
source: Remote Permissions
be: Адлеглыя правы доступу

# @info
source: This permission entry was inherited from a parent container and can only be modified on that parent (e.g. a higher level directory).
be: Гэты запіс правоў доступу быў пераняты ад бацькоўскага кантэйнера і можа быць зменены толькі ў гэтым бацькоўскім кантэйнеры (напрыклад, у каталозе больш высокага ўзроўню).

# @label
source: Type:
be: Тып:

# @label
source: Applies to:
be: Ужываецца да:

# @option:check
source: Traverse folder / execute file
be: Пераход да каталогаў / выкананне файлаў

# @option:check
source: List folder / read data
be: Пералік каталогаў / чытанне даных

# @option:check
source: Read attributes
be: Атрыбуты чытання

# @option:check
source: Read extended attributes
be: Пашыраныя атрыбуты чытання

# @option:check
source: Create files / write data
be: Стварэнне файлаў / запіс даных

# @option:check
source: Create folders / append data
be: Стварэнне каталогаў / дадаванне даных

# @option:check
source: Write attributes
be: Атрыбуты запісу

# @option:check
source: Write extended attributes
be: Пашыраныя атрыбуты запісу

# @option:check
source: Delete subfolders and files
be: Выдаленне ўкладзеных каталогаў і файлаў

# @option:check
source: Delete
be: Выдаліць

# @option:check
source: Read permissions
be: Правы на чытанне

# @option:check
source: Change permissions
be: Змяніць правы доступу

# @option:check
source: Take ownership
be: Зрабіць уладальнікам

# @option:check
source: Only apply these permissions to objects and/or containers within this container
be: Ужывайце гэтыя правы доступу толькі да аб'ектаў і(або) кантэйнераў у гэтым кантэйнеры

# @title
source: Access Control Entries
be: Запісы кантролю доступу

# @title file/folder owner info
source: Ownership
be: Валоданне

# @label
source: Owner:
be: Уладальнік:

# @label
source: Group:
be: Група:

# @info
source: No Permissions Found
be: Не знойдзена правоў доступу

# @info
source: There are probably no SMB/Windows/Advanced permissions set on this file.
be: Магчыма, для гэтага файла не вызначаны правы доступу SMB/Windows/Advanced.

# @info
source: User name <resource>%1</resource> is not valid as the name of a Samba user; cannot check for its existence.
be: Імя карыстальніка <resource>%1</resource> несапраўднае як імя карыстальніка Samba. Немагчыма праверыць яго існаванне.

# @info '%1 %2' together make up a terminal command; %3 is the command's output
source: Command <command>%1 %2</command> failed:<nl/><nl/>%3
be: Не ўдалося выканаць каманду <command>%1 %2</command>:<nl/><nl/>%3

# @info error while looking up uid from dbus
source: Could not resolve calling user.
be: Немагчыма развязаць выклік карыстальніка.

# @info
source: For security reasons, creating Samba users with empty passwords is not allowed.
be: З меркаванняў бяспекі забаронена ствараць карыстальнікаў Samba з пустымі паролямі.

# @info
source: <resource>%1</resource> is not a valid group name; cannot make user <resource>%2</resource> a member of it.
be: <resource>%1</resource> - няправільная назва групы. Нельга зрабіць карыстальніка <resource>%2</resource> яе ўдзельнікам.

# @info
source: For security reasons, cannot make user <resource>%1</resource> a member of group <resource>%2</resource>. The group name is insecure; valid group names do not include the text <resource>admin</resource> or <resource>root</resource>.
be: З меркаванняў бяспекі немагчыма зрабіць карыстальніка <resource>%1</resource> удзельнікам групы <resource>%2</resource>. Назва групы небяспечная; сапраўдныя назвы групаў не ўключаюць тэкст <resource>admin</resource> або <resource>root</resource>.

# @info:status
source: Your Samba installation appears to be broken.
be: Выглядае, што ў вас няправільна ўсталяваны пакет Samba.

# @info:status
source: This error is caused by your distribution not setting up Samba sharing properly. Please file a bug with your distribution or check your distribution's documentation on setting up Samba sharing.
be: Гэтая памылка звязаная з тым, што ваш дыстрыбутыў не наладзіў належным чынам Samba. Калі ласка, паведаміце пра хібу вашага дыстрыбутыва або пашукайце ў дакументацыі вашага дыстрыбутыва звесткі пра наладжванне агульнага доступу з дапамогай Samba.

# @info:status
source: This error is caused by your distribution not setting up Samba sharing properly. Please file a bug with your distribution or check your distribution's documentation on setting up Samba sharing. Error:<nl/><message>%1</message>
be: Гэтая памылка звязаная з тым, што ваш дыстрыбутыў не наладзіў належным чынам Samba. Калі ласка, паведаміце пра хібу вашага дыстрыбутыва або пашукайце ў дакументацыі вашага дыстрыбутыва звесткі пра наладжванне агульнага доступу з дапамогай Samba. Памылка:<nl/><message>%1</message>

# @info:status
source: This folder can't be shared because <filename>%1</filename> does not exist.
be: Гэта каталог нельга абагуліць, бо <filename>%1</filename> не існуе.

# @info:status
source: This folder can't be shared because your user account isn't a member of the <resource>%1</resource> group.
be: Гэты каталог нельга абагуліць, бо вашага акаўнта няма сярод удзельнікаў групы <resource>%1</resource>.

# @info:status
source: This folder can't be shared because your user account doesn't have permission to write into <filename>%1</filename>.
be: Гэты каталог нельга абагуліць, бо ваш акаўнт не мае правоў на запіс у <filename>%1</filename>.

# @info
source: Failed to make user <resource>%1</resource> a member of group <resource>%2</resource>
be: Не ўдалося зрабіць карыстальніка <resource>%1</resource> удзельнікам групы <resource>%2</resource>

# @title
source: File Path
be: Шлях да файла

# @title
source: Current Permissions
be: Бягучыя правы доступу

# @title
source: Required Permissions
be: Патрэбныя правы доступу

# @title
source: Denying Access
be: Адмаўленне ў доступе

# @info
source: Denying access prevents using this share even when another access rule might grant access. A denial rule always takes precedence. In particular denying access to <resource>Everyone</resource> actually disables access for everyone. It is generally not necessary to deny anyone because the regular directory and file permissions still apply to shared directories. A user who does not have access to the directory locally will still not be able to access it remotely even when the Share access rules would allow it.
be: Адмаўленне ў доступе прадухіляе выкарыстанне гэтымі абагуленымі рэсурсамі, нават калі іншае правіла доступу можа даць доступ. Правіла адмаўлення заўсёды мае прыярытэт. У прыватнасці, адмаўленне ў доступе <resource>Усім</resource> фактычна адключае доступ для ўсіх. Як правіла, няма неабходнасці нікому адмаўляць, бо звычайныя правы доступу на каталог і файлы па-ранейшаму ўжываюцца да абагулены каталогаў. Карыстальнік, які не мае лакальнага доступу да каталога, усё адно не зможа атрымаць да яго доступ нават адлегла, калі гэта дазволяць правілы доступу абагуленага рэсурсу.

# @action:button opens the change permissions page
source: Fix Permissions
be: Выправіць правы доступу

# @label
source: The share might not work properly because share folder or its paths has Advanced Permissions: %1
be: Агульны доступ можа не працаваць належным чынам, бо каталог агульнага доступу або шляхі да яго маюць дадатковыя правы доступу: %1

# @option:check
source: Share this folder with other computers on the local network
be: Абагуліць гэты каталог з іншымі камп'ютарамі ў лакальнай сетцы

# @label
source: Name:
be: Назва:

# @label
source: This name cannot be used. Share names must not be user names and there must not be two shares with the same name on the entire system.
be: Гэтую назву нельга выкарыстоўваць. Назвы абагуленых рэсурсаў не павінны быць імёнамі карыстальнікаў, і ва ўсёй сістэме не павінна быць двух абагуленых рэсурсаў з аднолькавай назвай.

# @label
source: This name may be too long. It can cause interoperability problems or get rejected by Samba.
be: Гэтая назва можа быць занадта доўгай. Праз гэта могуць з'явіцца праблемы ўзаемадзеяння або Samba можа адхіліць рэсурс.

# @label
source: Guest access is disabled by the system's Samba configuration.
be: Гасцявы доступ адключаны сістэмнай канфігурацыяй Samba.

# @option:radio user can read&write
source: Full Control
be: Поўны кантроль

# @option:radio user can read
source: Read Only
be: Толькі чытанне

# @option:radio user not allowed to access share
source: No Access
be: Няма доступу

# @label:textbox
source: Password
be: Пароль

# @label:textbox
source: Confirm password
be: Пацвердзіце пароль

# @action:button creates a new samba user with the user-specified password
source: Set Password
be: Прызначыць пароль

# @action:button changes permissions
source: Change Permissions
be: Змяніць правы доступу

# @action:button cancels permissions change
source: Cancel
be: Скасаваць

# @info
source: The <application>Samba</application> file sharing service must be installed before folders can be shared.
be: Перад тым, як абагульваць каталогі, трэба ўсталяваць службу агульнага доступу <application>Samba</application>.

# @button
source: Install Samba
be: Усталяваць Samba

# @label
source: The Samba package failed to install.
be: Не ўдалося ўсталяваць пакет Samba.

# @button restart the system
source: Restart
be: Перазапусціць

# @info
source: <para> Samba uses a separate user database from the system one. This requires you to set a separate Samba password for every user that you want to be able to authenticate with. </para> <para> Before you can access shares with your current user account you need to set a Samba password. </para>
be: <para> Samba выкарыстоўвае асобную ад сістэмнай базу даных карыстальнікаў. Для гэтага неабходна прызначыць асобны пароль Samba для кожнага карыстальніка, якому вы хочаце даць магчымасць прайсці аўтэнтыфікацыю. </para> <para> Перш чым вы атрымаеце доступ да абагуленых аб'ектаў з дапамогай вашага бягучага акаўнта, вам трэба прызначыць пароль Samba. </para>

# @info
source: Additional user management and password management can be done using Samba's <command>smbpasswd</command> command line utility.
be: Кіраваць карыстальнікамі і паролямі можна з дапамогай утыліты каманднага радка Samba<command>smbpasswd</command>.

# @info detailed error messsage
source: You have exhausted the maximum amount of shared directories you may have active at the same time.
be: Вы вычарпалі максімальную колькасць абагуленых каталогаў, якія могуць быць актыўнымі адначасова.

# @info detailed error messsage
source: The share name is invalid.
be: Назва абагуленага рэсурсу хібная.

# @info detailed error messsage
source: The share name is already in use for a different directory.
be: Назва абагуленага рэсурсу ўжо выкарыстоўваецца для іншага каталога.

# @info detailed error messsage
source: The path is invalid.
be: Хібны шлях.

# @info detailed error messsage
source: The path does not exist.
be: Шлях не існуе.

# @info detailed error messsage
source: The path is not a directory.
be: Шлях не ёсць каталогам.

# @info detailed error messsage
source: The path is relative.
be: Шлях адносны.

# @info detailed error messsage
source: This path may not be shared.
be: Гэта шлях нельга абагуліць.

# @info detailed error messsage
source: The access rule is invalid.
be: Правіла доступу несапраўднае.

# @info detailed error messsage
source: An access rule's user is not valid.
be: Карыстальнік правіла доступу несапраўдны.

# @info detailed error messsage
source: The 'Guest' access rule is invalid.
be: Правіла гасцявога доступу несапраўднае.

# @info detailed error messsage
source: Enabling guest access is not allowed.
be: Уключэнне гасцявога доступу забаронена.

# @info error in the underlying binaries. %1 is CLI output
source: <para>An error occurred while trying to share the directory. The share has not been created.</para><para>Samba internals report:</para><message>%1</message>
be: <para>Пры спробе абагуліць каталог адбылася памылка. Сеткавы рэсурс не быў створаны.</para><para>Унутраная справаздача Samba:</para><message>%1</message>

# @info/title
source: Failed to Create Network Share
be: Не ўдалося стварыць сеткавы рэсурс

# @info error in the underlying binaries. %1 is CLI output
source: <para>An error occurred while trying to un-share the directory. The share has not been removed.</para><para>Samba internals report:</para><message>%1</message>
be: <para>Пры спробе адклікаць агульны доступ да каталога адбылася памылка. Сеткавы рэсурс не быў выдалены.</para><para>Унутраная справаздача Samba:</para><message>%1</message>

# @info/title
source: Failed to Remove Network Share
be: Не ўдалося выдаліць сеткавы рэсурс

# @label kauth action description %1 is a username
source: Checking if Samba user '%1' exists
be: Правяранне існавання карыстальніка Samba "%1"

# @label kauth action description %1 is a username
source: Creating new Samba user '%1'
be: Стварэнне новага карыстальніка Samba "%1"
